Repository: quarkusio/pt.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: pt_br

source: We see that the value of the `first` key is now `37` which is exactly the result of `10 + 27`, quick maths.
pt_br: Vemos que o valor da chave `primeira` é agora `37` que é exatamente o resultado de `10 + 27`.

source: We will give a brief overview of the topic here; please refer to the link:{vthreadjep}[JEP 425] for more information.
pt_br: Faremos aqui um breve resumo do tema; para mais informações, consulte o link:{vthreadjep}[JEP 425].

source: We'll be using the Quarkus Redis extension to connect to interact with Redis.
pt_br: Vamos utilizar a extensão Quarkus Redis para nos conectar e interagir com o Redis.

source: Welcome to the Quarkus World Tour.
pt_br: Bem-vindo ao Quarkus World Tour.

source: What Makes Quarkus Different?
pt_br: O que torna o Quarkus diferente?

source: What are the extension statuses?
pt_br: Quais são os status de extensão?

source: What are virtual threads?
pt_br: O que são threads virtuais?

source: What does having a working C developer environment mean?
pt_br: O que significa ter um ambiente de desenvolvimento em C?

source: What does it mean to be a Kubernetes-native framework?
pt_br: O que significa ser uma estrutura nativa do Kubernetes?

source: What is Quarkus?
pt_br: O que é o Quarkus?

source: What is a Quarkus extension?
pt_br: O que é uma extensão do Quarkus?

source: What is your license?
pt_br: Qual é a sua licença?

source: What we mean by "Supersonic Subatomic Java".
pt_br: O que queremos dizer com "Java Subatômico Supersônico".

source: What's next?
pt_br: O que vem a seguir?

source: When Quarkus was designed, we didn’t focus only on containers but also on deploying Quarkus applications on container orchestrators such as Kubernetes. Quarkus build-time processing also generates the Kubernetes metadata, so your application is ready to be deployed on Kubernetes. Runtime capabilities such as health checks and metrics are exposed out of the box. Quarkus collects all the required metadata at build time to create the Kubernetes deployment descriptor and produce a container image. A single command line can deploy your application onto your Kubernetes cluster.
pt_br: Quando o Quarkus foi projetado, não nos concentramos apenas em contêineres, mas também na implantação de aplicativos Quarkus em orquestradores de contêineres, como o Kubernetes. O processamento em tempo de compilação do Quarkus também gera os metadados do Kubernetes, para que sua aplicação esteja pronta para ser implantado no Kubernetes. Os recursos de tempo de execução, como verificações de integridade e métricas, são expostos imediatamente. O Quarkus coleta todos os metadados necessários em tempo de compilação para criar o descritor de deployment do Kubernetes e produzir uma imagem de contêiner. Uma única linha de comando pode implantar seu aplicativo no cluster do Kubernetes.

source: When `objcopy` is not available debug symbols are embedded in the executable.
pt_br: Quando `objcopy` não está disponível, os símbolos de debug são incorporados no executável.

source: When running your application in JVM mode (so not compiled into native, for native check xref:native[the dedicated section]), you can follow the xref:./container-image.adoc[containerization guide] to build a container.
pt_br: Ao executar a sua aplicação em modo JVM (portanto, não compilada em modo nativo, para nativo consulte xref:native[a seção dedicada]), pode seguir o xref:./container-image.html[guia de conteinerização] para construir um contêiner.

source: When subscribing to a topic using a regular expression, you can pick a certain type of topics. * **PersistentOnly**: only subscribe to persistent topics. + * **NonPersistentOnly**: only subscribe to non-persistent topics. + * **AllTopics**: subscribe to both persistent and non-persistent topics.
pt_br: Ao assinar um tópico usando uma expressão regular, você pode escolher um determinado tipo de tópicos. * **PersistentOnly**: inscreva-se apenas em tópicos persistentes. + * **NonPersistentOnly**: inscreva-se apenas em tópicos não persistentes. + * **AllTopics**: inscreva-se em tópicos persistentes e não persistentes.

source: When used, the key is _watched_ and the _SET_ command is executed in a transaction (`MULTI/EXEC`).
pt_br: Quando utilizado, a chave é _vigiada_ e o comando _SET_ é executado numa transação ( `MULTI/EXEC`).

source: When using Redis as the backend for Quarkus cache, each cached item will be stored in Redis:
pt_br: Ao usar o Redis como backend para a cache do Quarkus, cada item armazenado em cache será armazenado no Redis:

source: When xDS is configured, `plain-text` is automatically disabled.
pt_br: Quando o xDS está configurado, o modo "plain-text" é automaticamente desabilitado.

source: When xDS target property is used, name resolver, host, and port are not used
pt_br: Quando a propriedade de destino do xDS é utilizada, o resolvedor de nomes, host e porta não são utilizados.

source: Where can I get it?
pt_br: Onde posso obtê-lo?

source: Whether Kafka client is created lazily or eagerly. Type: _boolean_
pt_br: Se o cliente Kafka é criado preguiçosamente ou ansiosamente. Tipo: _boolean_

source: Whether batch receive is used to consume messages
pt_br: Se o recebimento em lote é usado para consumir mensagens

source: Whether health reporting is enabled (default) or disabled
pt_br: Se o relatório de integridade está habilitado (padrão) ou desabilitado

source: Whether health reporting is enabled (default) or disabled Type: _boolean_
pt_br: Se o relatório de integridade está habilitado (padrão) ou desabilitado Tipo: _boolean_

source: Whether readiness health reporting is enabled (default) or disabled Type: _boolean_
pt_br: Se o relatório de integridade de prontidão está habilitado (padrão) ou desabilitado Tipo: _boolean_

source: Whether the client accepts untrusted TLS certificates from the broker.
pt_br: Se o cliente aceita certificados TLS não confiáveis do broker.

source: Whether the client waits for Kafka to acknowledge the written record before acknowledging the message Type: _boolean_
pt_br: Se o cliente espera que Kafka reconheça o registro escrito antes de reconhecer a mensagem Tipo: _boolean_

source: Whether the client waits for the broker to acknowledge the written record before acknowledging the message
pt_br: Se o cliente espera que o broker reconheça o registro escrito antes de reconhecer a mensagem

source: Whether the connector should allow multiple upstreams Type: _boolean_
pt_br: Se o conector deve permitir vários upstreams Tipo: _boolean_

source: Whether the connector should insert automatically the `time` attribute into the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `time` attribute itself Type: _boolean_
pt_br: Se o conector deve inserir automaticamente o atributo 'time' no evento de nuvem de saída. Requer que 'cloud-events' seja definido como 'true'. Esse valor será usado se a mensagem não configurar o próprio atributo 'time' Tipo: _boolean_

source: Whether the hostname is validated when the client creates a TLS connection with brokers.
pt_br: Se o nome do host é validado quando o cliente cria uma conexão TLS com brokers.

source: Whether the startup and readiness check should verify that topics exist on the broker. Default to false. Enabling it requires an admin client connection. Type: _boolean_
pt_br: Se a verificação de inicialização e prontidão deve verificar se os tópicos existem no broker. O padrão é false. Habilitá-lo requer uma conexão de cliente administrador. Tipo: _boolean_

source: Whether to automatically acknowledge pending chunked messages when the threshold of `maxPendingChunkedMessage` is reached. If set to `false`, these messages will be redelivered by their broker.
pt_br: Se as mensagens em bloco pendentes devem ser confirmadas automaticamente quando o limite de 'maxPendingChunkedMessage' for atingido. Se definido como 'false', essas mensagens serão reentregues pelo corretor.

source: Whether to enable BusyWait for EpollEventLoopGroup.
pt_br: Se deseja habilitar BusyWait para EpollEventLoopGroup.

source: Whether to enable transaction.
pt_br: Se deve habilitar a transação.

source: Whether to use TCP NoDelay option.
pt_br: Se deve usar a opção TCP NoDelay.

source: Whether to use TLS.
pt_br: Se deve usar TLS.

source: Whether tracing is enabled (default) or disabled
pt_br: Se o rastreamento está habilitado (padrão) ou desabilitado

source: Whether tracing is enabled (default) or disabled Type: _boolean_
pt_br: Se o rastreamento está habilitado (padrão) ou desabilitado Tipo: _boolean_

source: While it's the CRaC API, SnapStart is not CRaC and can do _things_ that would not work with others CRaC implementations.
pt_br: Embora seja a API CRaC, o SnapStart não é CRaC e pode fazer _coisas_ que não funcionariam com outras implementações CRaC.

source: While there are several benefits to using a database to store transaction logs, you might notice a reduction in performance compared with using the file system to store the logs.
pt_br: Embora existam vários benefícios na utilização de uma base de dados para armazenar registos de transacções, poderá notar uma redução no desempenho em comparação com a utilização do sistema de ficheiros para armazenar os registos.

source: While you are encouraged to use CDI annotations for injection, Quarkus provides a compatibility layer for Spring dependency injection in the form of the spring-di extension.
pt_br: Embora você seja encorajado a usar anotações CDI para injeção, o Quarkus fornece uma camada de compatibilidade para injeção de dependência do Spring na forma da extensão spring-di.

source: While you are encouraged to use Hibernate ORM with Panache for your data layer, Quarkus provides a compatibility layer for Spring Data JPA in the form of the spring-data-jpa extension.
pt_br: Embora você seja encorajado a usar o Hibernate ORM com o Panache para sua camada de dados, o Quarkus fornece uma camada de compatibilidade para o Spring Data JPA na forma da extensão spring-data-jpa.

source: While you are encouraged to use JAX-RS annotations for defining REST endpoints, Quarkus provides a compatibility layer for Spring Web in the form of the spring-web extension.
pt_br: Embora você seja encorajado a usar anotações JAX-RS para definir pontos de extremidade REST, o Quarkus fornece uma camada de compatibilidade para o Spring Web na forma da extensão spring-web.

source: While you are encouraged to use the Cache extension for your application-level caching, Quarkus provides a compatibility layer for Spring Cache in the form of the spring-cache extension.
pt_br: Embora você seja encorajado a usar a extensão Cache para seu cache no nível do aplicativo, o Quarkus fornece uma camada de compatibilidade para o Spring Cache na forma da extensão spring-cache.

source: While you are encouraged to use the Quarkus security layer to secure your applications, Quarkus provides a compatibility layer for Spring Security in the form of the spring-security extension.
pt_br: Embora você seja encorajado a usar a camada de segurança do Quarkus para proteger seus aplicativos, o Quarkus fornece uma camada de compatibilidade para o Spring Security na forma da extensão spring-security.

source: While you are encouraged to use the Scheduler or Quartz extensions to schedule tasks, Quarkus provides a compatibility layer for Spring Scheduled in the form of the spring-scheduled extension.
pt_br: Embora você seja encorajado a usar as extensões Scheduler ou Quartz para agendar tarefas, o Quarkus fornece uma camada de compatibilidade para o Spring Scheduled na forma da extensão agendada para primavera.

source: Why always having a transaction manager?
pt_br: Por que sempre ter um gerenciador de transações?

source: Why do you prefer JTA vs Hibernate's transaction management API
pt_br: Por que você prefere a API de gerenciamento de transações do JTA vs Hibernate

source: Why not run everything on virtual threads?
pt_br: Por que não executar tudo em threads virtuais?

source: Will the Quarkus team accept my extension?
pt_br: A equipe do Quarkus aceitará minha extensão?

source: With <a href="https://code.quarkus.io/">code.quarkus.io</a>, in a few clicks, you can bootstrap your Quarkus application and discover its extension ecosystem.
pt_br: Com <a href="https://code.quarkus.io/">code.quarkus.io</a>, em poucos cliques, você pode inicializar seu aplicativo Quarkus e descobrir seu ecossistema de extensões.

source: With Funqy, a function is just:
pt_br: Com o Funqy, uma função é apenas:

source: With Panache, the <code>Element</code> class would be as simple as:
pt_br: Com o Panache, a classe <code>Element</code> seria tão simples quanto:

source: With Quarkus, you can easily configure a datasource, or several if need be.
pt_br: Com o Quarkus, você pode configurar facilmente uma fonte de dados ou várias, se necessário.

source: With the *Kafka Dev UI*, you can directly manage your Kafka cluster and perform tasks, such as:
pt_br: Com o *Kafka Dev UI*, pode gerenciar diretamente o seu cluster Kafka e executar tarefas, tais como:

source: Working with HashiCorp Vault’s Authentication
pt_br: Trabalhando com a autenticação do HashiCorp Vault

source: Write Your First Application
pt_br: Escreva Seu Primeiro Aplicativo

source: Write a Spring Data Application
pt_br: Escrever uma aplicação Spring Data

source: Writing Extensions
pt_br: Escrevendo extensões

source: Writing JSON REST services
pt_br: Escrevendo serviços JSON REST

source: Writing Native Applications
pt_br: Escrever aplicações nativas

source: Writing REST JSON Services
pt_br: Escrevendo serviços JSON REST

source: Writing REST Services Reference
pt_br: Referência de escrita de serviços REST

source: Writing Simple CRUD Applications with Spring Data
pt_br: Escrevendo aplicativos CRUD simples com Spring Data

source: Writing Simple REST CRUD Services
pt_br: Escrevendo serviços REST CRUD simples

source: Writing Your Own Extension
pt_br: Escrevendo sua própria extensão

source: Writing a Codestart for an extension
pt_br: Escrevendo um Codestart para uma extensão

source: XCode provides the required dependencies on macOS:
pt_br: O XCode fornece as dependências necessárias no macOS:

source: YAML Configuration
pt_br: Configuração YAML

source: YAML as a Configuration Source.
pt_br: YAML como uma fonte de configuração.

source: Yes, we consider Quarkus stable. Remember 95% of the features Quarkus apps use are provided by the ecosystem like Hibernate ORM, Eclipse Vert.x, Netty, RESTEasy, etc. These libraries are rock solid :)
pt_br: Sim, consideramos o Quarkus estável. Lembre-se que 95% dos recursos que os aplicativos Quarkus usam são fornecidos pelo ecossistema como Hibernate ORM, Eclipse Vert.x, Netty, RESTEasy, etc. Essas bibliotecas são sólidas :)

source: You can also configure the time to live of the cached entries:
pt_br: Também é possível configurar o tempo de vida das entradas em cache:

source: You can also specify a different Cognito claim to extract roles from:
pt_br: Você também pode especificar uma reivindicação do Cognito diferente para extrair funções:

source: You can also use a simplified format, starting with a number:
pt_br: Você também pode usar um formato simplificado, começando com um número:

source: You can configure the Dev Services for Pulsar with custom broker configuration.
pt_br: É possível configurar o Dev Services para a Pulsar com a configuração personalizada do broker.

source: You can configure the default transaction timeout, the timeout that applies to all transactions managed by the transaction manager, via the property `quarkus.transaction-manager.default-transaction-timeout`, specified as a duration.
pt_br: Pode configurar o tempo limite de transação predefinido, o tempo limite que se aplica a todas as transacções geridas pelo gestor de transacções, através da propriedade `quarkus.transaction-manager.default-transaction-timeout`, especificada como uma duração.

source: You can configure timeout for Kafka admin client calls used in topic creation using `quarkus.kafka.devservices.topic-partitions-timeout`, it defaults to 2 seconds.
pt_br: Você pode configurar o tempo limite para as chamadas do client admin do Kafka utilizadas na criação de tópicos utilizando `quarkus.kafka.devservices.topic-partitions-timeout`. A predefinição é de 2 segundos.

source: You can control whether and how the transaction is started with parameters on `@Transactional`:
pt_br: Você pode controlar se e como a transação é iniciada com parâmetros em '@Transactional':

source: You can disable the preloading of classes using:
pt_br: Você pode desativar o pré-carregamento de classes utilizando:

source: You can disable this feature using:
pt_br: Você pode desativar esta funcionalidade utilizando:

source: You can enable optimistic locking using:
pt_br: É possível ativar o bloqueio otimista utilizando:

source: You can find more information about how to configure the native image building process in the xref:configuration-reference[Configuring the Native Executable] section below.
pt_br: Você pode encontrar mais informações sobre como configurar o processo de construção de uma imagem nativa na secção link:#configuration-reference[Configurando o executável nativo] abaixo.

source: You can find the extension status on https://code.quarkus.io[code.quarkus.io] or in the extension link:/guides/[guides].
pt_br: Você pode encontrar o status da extensão em https://code.quarkus.io[code.quarkus.io] ou no link da extensão:/guides/[guides].

source: You can go to https://code.quarkus.io/[code.quarkus.io] to see if a particular extension is _stable_ (default) or _preview_.
pt_br: Você pode ir para https://code.quarkus.io/[code.quarkus.io] para ver se uma determinada extensão é _stable_ (padrão) ou _preview_.

source: You can manually create the transaction log table during the initial setup by setting the `create-table` property to `true`.
pt_br: É possível criar manualmente a tabela de registro de transações durante a configuração inicial, definindo a propriedade `create-table` como `true`.

source: You can read more about UBI images on:
pt_br: Você pode ler mais sobre as imagens UBI em:

source: You can run the application as a conventional jar file.
pt_br: Você pode executar a aplicação como um arquivo jar convencional.

source: You can then test the executable locally with sam local
pt_br: Você pode então testar o executável localmente com sam local

source: You can update or upgrade your {project-name} projects to the latest version of {project-name} by using an update command.
pt_br: Você pode atualizar ou subir a versão dos seus projetos {project-name} para a versão mais recente de {project-name} utilizando um comando update.

source: You can use any of the Quarkus features in your function and benefit from the fast startup and low memory utilization. With Quarkus, you can embrace this new world without having to change your programming language.
pt_br: Você pode usar qualquer um dos recursos do Quarkus em sua função e se beneficiar da inicialização rápida e da baixa utilização de memória. Com o Quarkus, você pode abraçar esse novo mundo sem ter que mudar sua linguagem de programação.

source: You can use the JPA entity manager directly. Panache proposes an alternative removing boilerplate and exposing an active record and repository models.
pt_br: Você pode usar o gerenciador de entidade JPA diretamente. Panache propõe uma alternativa removendo clichês e expondo uma solução active record e também modelado como um repositório.

source: You cannot use `UserTransaction` in a method having a transaction started by a `@Transactional` call.
pt_br: Não é possível utilizar `UserTransaction` num método com uma transação iniciada por uma chamada `@Transactional`.

source: You have found nowhere.<br/>The pathway to normal space<br/>is found in the nav.
pt_br: Você não encontrou nenhum lugar.<br/>O caminho para o espaço normal<br/>é encontrado na navegação.

source: You have installed at least one extension that provides an `IdentityProvider` based on username and password, such as xref:security-jdbc.adoc[Elytron JDBC].
pt_br: Você instalou pelo menos uma extensão que fornece um `IdentityProvider` baseado no usename e no password, como o link:security-jdbc.html[Elytron JDBC].

source: You need clustering support for your scheduled tasks? This guide explains how to use the Quartz extension for that.
pt_br: Você precisa de suporte a clustering para suas tarefas agendadas? Este guia explica como usar a extensão Quartz para isso.

source: You often need to execute custom actions when the application starts and clean up everything when the application stops. This guide explains how to be notified when an application stops or starts.
pt_br: Muitas vezes, você precisa executar ações personalizadas quando a aplicação é iniciada e limpar tudo quando o aplicativo para. Este guia explica como ser notificado quando um aplicativo para ou é iniciado.

source: Your help is more than welcome! Don’t hesitate to join the crowd.
pt_br: A sua ajuda é mais do que bem-vinda! Não hesite em juntar-se à multidão.

source: Your implemented provider must be a CDI bean. Here's an example:
pt_br: O seu provider implementado deve ser um bean CDI. Eis um exemplo:

source: Your project might use an extension that is incompatible with the latest {project-name} version.
pt_br: O seu projeto pode estar utilizando uma extensão que é incompatível com a versão mais recente do {project-name}.

source: Zero config, live reload in the blink of an eye
pt_br: Configuração zero, recarga ao vivo em um piscar de olhos

source: _deprecated_ - During the readiness health check, the connector connects to the broker and retrieves the list of topics. This attribute specifies the maximum duration (in ms) for the retrieval. If exceeded, the channel is considered not-ready. Deprecated: Use 'health-topic-verification-timeout' instead. Type: _long_
pt_br: _deprecated_ - Durante a verificação de integridade de prontidão, o conector se conecta ao broker e recupera a lista de tópicos. Esse atributo especifica a duração máxima (em ms) para a recuperação. Se excedido, o canal é considerado não pronto. Preterido: use 'health-topic-verification-timeout' em vez disso. Tipo: _long_

source: _deprecated_ - Whether the readiness check should verify that topics exist on the broker. Default to false. Enabling it requires an admin connection. Deprecated: Use 'health-topic-verification-enabled' instead. Type: _boolean_
pt_br: _deprecated_ - Se a verificação de prontidão deve verificar se os tópicos existem no broker. O padrão é false. Habilitá-lo requer uma conexão de administrador. Deprecated: use 'health-topic-verification-enabled' em vez disso. Tipo: _boolean_

source: `-Dquarkus.native.container-build=true` will produce an additional text file named `native-builder.image` holding the docker image name to be used to build the native image.
pt_br: `-Dquarkus.native.container-build=true` produzirá um arquivo de texto adicional chamado `native-builder.image` com o nome da imagem docker a ser utilizada para construir a imagem nativa.

source: `@Transactional(MANDATORY)`: fails if no transaction was started ; works within the existing transaction otherwise.
pt_br: `@Transactional(MANDATORY)`: falha se não tiver sido iniciada nenhuma transação; caso contrário, funciona dentro da transação existente.

source: `@Transactional(NEVER)`: if a transaction was started, raises an exception ; otherwise works with no transaction.
pt_br: `@Transactional(NEVER)`: se foi iniciada uma transação, levanta uma exceção; caso contrário, funciona sem transação.
